# Кортеж (tuple) — это упорядоченная и неизменяемая коллекция объектов.

### Особенности :
1. Неизменяемость (иммутабельность). Как только кортеж создан, нельзя изменить его содержимое. Это отличает кортежи от списков, которые могут быть изменены (mutable).

2. Упорядоченность. Элементы кортежа упорядочены. Это означает, что они имеют определенный порядок. Элементы располагаются в том порядке, в котором были добавлены в кортеж.

3. Возможность хранения разных типов данных. Кортеж может содержать элементы различных типов данных, в том числе строки, числа, списки и другие кортежи.

### Создание кортежа

1. Кортежи могут быть созданы с помощью круглых скобок:
```
my_tuple = (1, 2, 3, 'a', 'b')

```
2. Кортежи могут быть созданы без явного использования скобок:
```
another_tuple = 4, 5, 'c'

```
3. Для создания кортежа можно использовать функцию 
tuple() :
```
another_another_tuple = tuple([1, 2, 3, 'a', 'b'])
```

### Функция tuple(), как и функция для создания множеств set(), принимает список элементов в качестве аргумента для создания кортежа

### Элементы кортежа аналогично спискам можно получить с помощью индексации:

```
my_tuple = (1, 2, 3, 'a', 'b')
print(my_tuple[0])

>>> 1
```

### Особенность работы с кортежем из одного элемента

Чтобы создать кортеж из одного элемента, необходимо добавить запятую после элемента:
```
single_element_tuple = (1,)
```
Или можно использовать функцию 
tuple():
```
single_element_tuple = tuple([1])
```
### Подход с запятой — способ явно указать, что вы создаете кортеж. В противном случае Python интерпретирует скобки как часть арифметического выражения.

### Методы кортежей:

1. Метод count() — возвращает количество вхождений заданного значения в кортеже:
```
my_tuple = (1, 2, 2, 3, 2, 4)
count_of_2 = my_tuple.count(2)

print(count_of_2)
>>> 3
```
2. Метод index() — возвращает индекс первого вхождения заданного значения в кортеже:
```
my_tuple = (1, 2, 3, 4, 5)
index_of_3 = my_tuple.index(3)

print(index_of_3)
>>> 2
```
Если значение не найдено, возникает исключение 
ValueError

### Функции для работы с кортежами:

1. Функция len()
 — возвращает количество элементов в кортеже:
 ```
 my_tuple = (1, 2, 3, 4, 5)
length = len(my_tuple)

print(length)
>>> 5
```
2. Функции max() и min() — возвращают соответственно максимальное и минимальное значение в кортеже:
```
my_tuple = (1, 2, 3, 4, 5)
maximum = max(my_tuple)
minimum = min(my_tuple)

print(maximum)
print(minimum)
>>> 5
    1
```
3. Функция sorted() — возвращает новый отсортированный список **(не кортеж)** из элементов кортежа:
```
my_tuple = (3, 1, 4, 1, 5, 9, 2)
sorted_list = sorted(my_tuple)

print(sorted_list)
>>> [1, 1, 2, 3, 4, 5, 9]
```

### Использование кортежей

Они полезны, когда вам нужна неизменяемая структура данных, особенно для представления коллекции элементов, которые не должны изменяться в процессе выполнения программы.

### Кортежи также часто используются при возврате нескольких значений из функций:
```
def get_coordinates():
    x = 10
    y = 20
    return x, y

coordinates = get_coordinates()

print(coordinates)
>>> (10, 20)
```
### Взаимодействие с элементами кортежей
Мы уже говорили, что кортежи похожи на списки, поэтому:

1. кортежи поддерживают получение элемента по индексу с помощью []

2. для получения части кортежа используются срезы

3. для обработки каждого элемента кортеж можно обойти циклом.

Все эти операции в кортежах работают аналогично спискам.